function [water_vapor] = NumberOfWP(t_air, method, t_air_array, w_0_array)
% Питома кількість осаджених парів води мм/км
% t_air - температура повітря, °С
% method - метод розрахунку
% 0 - розрахунок за апроксимованою формулою, + більший діапазон значень
% 1 - розрахунок за табличними даними, - t = [-50,+50]°С
% t_air_array - масив даних темперарур для 1-го методу
% w_0_array - масив даних питомої кількості осадженої води для 1-го методу

%% Для помилки
str = 'Помилка (типу) вхідних даних.';

if (min(t_air(:)) < -273.15)
    error(str);
end

%% Питома кількість осадженої води, тобто при 100% вологості повітря
if (method == 0)
%     water_vapor = 8.762 .* 10^-4 .* exp(0.0534 .* t_air) -...
%         1.652 .* 10^-4 .* exp(-0.05 .* (t_air + 49.5));
    water_vapor = 8.762 .* 10^-4 .* exp(0.0534 .* t_air);
else
    if (min(t_air(:)) < -50 || 50 < max(t_air(:)))
        error(str);
    end
    
    water_vapor = interp1(t_air_array, w_0_array, t_air);
end

water_vapor = (2.167 .* 10 .^ 6) .* water_vapor ./...
    (t_air + 273.15);

end

