function [height] = RealHeight(length, angle, h_0, R_k)
% Розрахунок реальної висоти, тобто врахування сферичності атмосфери,
% або ж висоти відповідного шару
% length - довжина шляху між цілю і ГСН або заданою точкою в просторі, км
% angle - нахил відносно горизонту [°]
% h_0 - висота розташування цілі/об'єкта, км
% R_k - радіус кривизни Землі у відповідій точці, км
% height - висота відповідного шару, км

% Переводимо градуси в радіани
angle = deg2rad(angle);

a = R_k + h_0;

height = sqrt(a .^ 2 + length .^ 2 + 2 .* a .* ...
    length .* sin(angle)) - R_k;

end

