function [tau] = TauScat(lamda, d_eff, d_v)
% Коефіцієнт пропускання за рахунок розсіювання
% lamda - довжина хвилі, мкм
% d_eff - ефективна довжина шляху/траси, км
% d_v - метеорологічна дальність видимості; умови спостереження:
% Дуже погані:
%     (0...0,05) - дуже сильний туман;
%     (0,05...0,2) - сильний туман, густий сніг;
%     (0,2...0,5) - помірний туман, сильний сніг;
% Погані:
%     (0,5...1) - слабкий туман, помірний сніг;
%     (1...2) - дуже сильний дощ, помірний серпанок або сніг;
% Середні:
%     (2...4) - сильний дощ, слабкий серпанок або сніг;
%     (4...10) - помірний дощ, дуже слабкий серпанок або сніг;
% Хороші:
%     (10...20) - без опадів чи слабкий дощ;
% Дуже хороші:
%     (20...50) - без опадів;
% Виняткові:
%     (более 50) - дуже чисте повітря;

%% Для помилки
str = 'Помилка (типу) вхідних даних.';

if (min(lamda) < 0.3 || max(lamda) > 14)
    error(str);
end

% Спектральний коефіцієнт пропускання атмосфери зумовлений розсіюванням:
n = 0.585 .* d_v .^ (1 / 3);
k_s = (3.91 ./ d_v) .* (lamda ./ 0.55) .^ -n;

% Пропускання
tau = exp(-k_s .* d_eff);

end

